In [8]:
import pandas as pd
#Criar um DataFrame
data = {'Empresa': ['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Nome': ['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Venda': [200,120,340,124,243,350]}

In [27]:
df = pd.DataFrame(data)

In [28]:
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [29]:
group = df.groupby('Empresa')

In [30]:
group

In [31]:
group.sum()

C:\Users\victo\AppData\Local\Temp\ipykernel_15916\2427340437.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  group.sum()

         Venda
Empresa
FB         593
GOOG       320
MSFT       464

In [16]:
group.mean()

C:\Users\victo\AppData\Local\Temp\ipykernel_15916\3928442431.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  group.mean()

         Venda
Empresa
FB       296.5
GOOG     160.0
MSFT     232.0

In [18]:
group.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [19]:
group.count()

         Nome  Venda
Empresa
FB          2      2
GOOG        2      2
MSFT        2      2

In [21]:
group = df.groupby('Nome')

In [25]:
group.sum().loc['Amy']

C:\Users\victo\AppData\Local\Temp\ipykernel_15916\4102175638.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  group.sum().loc['Amy']

Venda    340
Name: Amy, dtype: int64